# CreateConduitConnector Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ConnectorElement..::..CreateConduitConnector Method
ConnectorElement Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CreateConduitConnector(Document, Reference) | Create a new conduit ConnectorElement. |
| CreateConduitConnector(Document, Reference, Edge) | Create a new conduit ConnectorElement. |

# See Also
ConnectorElement Class
ConnectorElement Members
Autodesk.Revit.DB Namespace